coupled_simulation/fluid-openfoam/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

vertices
(
    (-6  -3  0)
    ( 14 -3  0)
    ( 14  3  0)
    (-6   3  0)
    (-6  -3  6)
    ( 14 -3  6)
    ( 14  3  6)
    (-6   3  6)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (40 12 12) simpleGrading (1 1 1)
);

edges
(
);

boundary (

    walls
    {
        type wall;
        faces
        (
        (1 5 4 0) // Parete inferiore (-y)
        (3 7 6 2) // Parete superiore (+y)
        (4 5 6 7) // Parete posteriore (+z)
        (0 1 2 3) // Parete frontale (-z)
        );
    }

    inlet
    {
        type patch;
        faces
	(
	    (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
);


// ************************************************************************* //
